// Дана строка в виде числа. Необходимо просуммиоровать все элементы числа
// ‘123’ -> 6

// let a = `123`.split(``)
// let b = 0
// for (i = 0; i < a.length; i = 0) {
//     b += a[i]
// }
// console.log(b);

// На вход подается число. Необходимо вывести все числа от 1 до введенного числа
// кратные 3.

// let a = 33
// let b = []
// for (i = 0; i < a; i++) {
//     a = +a
//     if (i % 3 == 0) {
//         b.push(i)
//     }
// }
// console.log(b.join(`,`));

// Дан статичный массив с элементами и число вводимое с клавиатуры. С помощью
// цикла for и оператора if проверьте есть ли в массиве введенное число. Если есть,
// то остановите выполнение цикла. Если нет, то найдите среднее арифметическое
// всех чисел

// let a = [1, 2, 3, 4, 5]
// let b = 4
// let res = []
// for (let i = 0; i < a.length; i++) {
//     if (a[i] === b) {
//         console.log(`true`);
//         break
//     } else {
//         res.push(a[i])
//     }
//     if (res.lenght == a.lenght) {
//         let sum = 0
//         for (let i = 0; i < a.length; i++) {
//             sum += a[i]
//         }
//         console.log(sum / a.length);
//     }
// }

// let arr = [-7, -2, -3, -4, -5, -1, -3, -2]
// let a = arr[0]
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] > a) {
//         a = arr[i]
//     }
// }
// console.log(a);


